# hack nerd font for terminal
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

tap "mongodb/brew"


# general brew packages
brew 'azure-cli'
brew 'azure-functions-core-tools'
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'thefuck'
brew 'gpg'
brew 'mas'
brew 'fzf'
brew 'kubectl'
brew 'minikube'
brew 'postgres'
brew 'mongodb-community@4.2'
brew 'robo3t'
brew 'mysql@5.7'

# app store apps
mas "1Password 7", id: 1333542190
mas "iMovie", id: 408981434
mas "Ulysses", id: 1225570693
mas "CopyClip", id: 1020812363
mas "GIPHY CAPTURE", id: 668208984
mas "Slack", id: 803453959
mas "Time Out", id: 402592703
mas "WhatsApp", id: 1147396723
mas "Pages", id: 409201541
mas "Caffeinated", id: 1362171212
mas "Telegram", id: 747648890
mas "GarageBand", id: 682658836
mas "DaisyDisk", id: 411643860
mas "Numbers", id: 409203825
mas "Pixelmator Pro", id: 1289583905
